Res-firecracker-set-v66/firecracker_t_4_c_6_frontVcpu_2_wrkVcpu_1/wrk.txt
Running 1m test @ http://frontend:5000
  4 threads and 6 connections
  Thread calibration: mean lat.: 5099.783ms, rate sampling interval: 17858ms
  Thread calibration: mean lat.: 5098.303ms, rate sampling interval: 18055ms
  Thread calibration: mean lat.: 5044.495ms, rate sampling interval: 17874ms
  Thread calibration: mean lat.: 5102.068ms, rate sampling interval: 18006ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    31.02s    11.46s    0.90m    64.07%
    Req/Sec   243.75      1.98   247.00     87.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   32.34s 
 75.000%   36.60s 
 90.000%   48.69s 
 99.000%    0.90m 
 99.900%    0.91m 
 99.990%    0.91m 
 99.999%    0.91m 
100.000%    0.91m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9945.087     0.000000            2         1.00
   14925.823     0.100000         4879         1.11
   19857.407     0.200000         9762         1.25
   24526.847     0.300000        14624         1.43
   29245.439     0.400000        19498         1.67
   32342.015     0.500000        24409         2.00
   32931.839     0.550000        26865         2.22
   33554.431     0.600000        29273         2.50
   34668.543     0.650000        31697         2.86
   35586.047     0.700000        34168         3.33
   36601.855     0.750000        36581         4.00
   37388.287     0.775000        37771         4.44
   38961.151     0.800000        38993         5.00
   41418.751     0.825000        40214         5.71
   43843.583     0.850000        41424         6.67
   46399.487     0.875000        42660         8.00
   47644.671     0.887500        43254         8.89
   48693.247     0.900000        43874        10.00
   49938.431     0.912500        44473        11.43
   51183.615     0.925000        45089        13.33
   52133.887     0.937500        45706        16.00
   52428.799     0.943750        46001        17.78
   52658.175     0.950000        46328        20.00
   52854.783     0.956250        46651        22.86
   53018.623     0.962500        46916        26.67
   53215.231     0.968750        47251        32.00
   53313.535     0.971875        47397        35.56
   53411.839     0.975000        47539        40.00
   53510.143     0.978125        47693        45.71
   53608.447     0.981250        47844        53.33
   53706.751     0.984375        47990        64.00
   53772.287     0.985938        48088        71.11
   53805.055     0.987500        48132        80.00
   53870.591     0.989062        48222        91.43
   53936.127     0.990625        48324       106.67
   53968.895     0.992188        48367       128.00
   54001.663     0.992969        48408       142.22
   54034.431     0.993750        48452       160.00
   54067.199     0.994531        48493       182.86
   54099.967     0.995313        48526       213.33
   54132.735     0.996094        48562       256.00
   54132.735     0.996484        48562       284.44
   54165.503     0.996875        48592       320.00
   54198.271     0.997266        48611       365.71
   54231.039     0.997656        48635       426.67
   54263.807     0.998047        48653       512.00
   54263.807     0.998242        48653       568.89
   54296.575     0.998437        48672       640.00
   54296.575     0.998633        48672       731.43
   54329.343     0.998828        48684       853.33
   54362.111     0.999023        48695      1024.00
   54362.111     0.999121        48695      1137.78
   54362.111     0.999219        48695      1280.00
   54394.879     0.999316        48704      1462.86
   54427.647     0.999414        48712      1706.67
   54427.647     0.999512        48712      2048.00
   54427.647     0.999561        48712      2275.56
   54460.415     0.999609        48717      2560.00
   54460.415     0.999658        48717      2925.71
   54493.183     0.999707        48727      3413.33
   54493.183     0.999756        48727      4096.00
   54493.183     0.999780        48727      4551.11
   54493.183     0.999805        48727      5120.00
   54493.183     0.999829        48727      5851.43
   54493.183     0.999854        48727      6826.67
   54525.951     0.999878        48733      8192.00
   54525.951     1.000000        48733          inf
#[Mean    =    31024.947, StdDeviation   =    11459.660]
#[Max     =    54493.184, Total count    =        48733]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58127 requests in 1.00m, 23.96MB read
Requests/sec:    968.78
Transfer/sec:    408.92KB